app/Models/InventoryModel.php

SELECT *
FROM `inventory`
WHERE `quantity` < 10
---
    public function getStaffTasks()
    {
        return $this->where('quantity <', 10)->findAll();

SELECT *
FROM `inventory`
---
    public function getAll()
    {
        return $this->findAll();