app/Models/PhysicalCountModel.php

SELECT *
FROM `physical_counts`
WHERE `status` = 'active'
---
    public function getActiveCount()
    {
        return $this->where('status', 'active')->findAll();