app/Models/ShipmentModel.php

    public function getIncoming()
    {
        return $this->where('type', 'incoming')
                   ->where('status !=', 'completed')
                   ->findAll();
---
SELECT *
FROM `shipments`
WHERE `type` = 'incoming'
AND `status` != 'completed'

    public function getOutgoing()
    {
        return $this->where('type', 'outgoing')
                   ->where('status !=', 'completed')
                   ->findAll();
---
SELECT *
FROM `shipments`
WHERE `type` = 'outgoing'
AND `status` != 'completed'