app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'staff'
 LIMIT 1
---
    public function authenticate($username, $password)
    {
        $user = $this->where('username', $username)->first();